PiBoxY/msp430ware/examples/boards/MSP-EXP430FR4133/MSP-EXP430FR4133_Software_Examples/Firmware/Source/OutOfBox_MSP430FR4133/driverlib/MSP430FR2xx_4xx/cs.c
static void privateCSComputeDCOFTrim(CS_initFLLParam *param)
{
    uint16_t oldDcoTap = 0xffff;
    uint16_t newDcoTap = 0xffff;
    uint16_t newDcoDelta = 0xffff;
    uint16_t bestDcoDelta = 0xffff;
    uint16_t csCtl0Copy = 0;
    uint16_t csCtl1Copy = 0;
    uint16_t csCtl0Read = 0;
    uint16_t csCtl1Read = 0;
    uint16_t dcoFreqTrim = 3;
    bool endLoop = false;

    do
    {
        HWREG16(CS_BASE + OFS_CSCTL0) = DCO8;   // DCO Tap = 256
        do
        {
            HWREG16(CS_BASE + OFS_CSCTL7) &= ~DCOFFG;   // Clear DCO fault flag
        }
        while(HWREG16(CS_BASE + OFS_CSCTL7) & DCOFFG);

        switch((HWREG16(CS_BASE + OFS_CSCTL1) & DCORSEL_7) >> 1)
        {
        // Wait FLL lock status (FLLUNLOCK) stable
        // Suggest to wait 24 cycles of divided FLL refclk
        case 0:     // 1 MHz
            __delay_cycles((uint16_t)3000);
            break;
        case 1:     // 2 MHz
            __delay_cycles((uint16_t)3000 * 2);
            break;
        case 2:     // 4 MHz
            __delay_cycles((uint16_t)3000 * 4);
            break;
        case 3:     // 8 MHz
            __delay_cycles((uint16_t)3000 * 8);
            break;
        case 4:     // 12 MHz
            __delay_cycles((uint16_t)3000 * 12);
            break;
        case 5:     // 16 MHz
            __delay_cycles((uint16_t)3000 * 16);
            break;
        default:        // reserved
            __delay_cycles((uint16_t)3000 * 16);
            break;
        }

        // Poll the FLLUNLOCK bits and DCOFFG bit until FLL is locked or DCO fault
        while((HWREG16(CS_BASE + OFS_CSCTL7) & (FLLUNLOCK0 | FLLUNLOCK1)) &&
              ((HWREG16(CS_BASE + OFS_CSCTL7) & DCOFFG) == 0))
        {
            ;
        }

        csCtl0Read = HWREG16(CS_BASE + OFS_CSCTL0); // Read CSCTL0
        csCtl1Read = HWREG16(CS_BASE + OFS_CSCTL1); // Read CSCTL1

        oldDcoTap = newDcoTap;  // Record DCOTAP value of last time
        newDcoTap = csCtl0Read & 0x01ff;    // Get DCOTAP value of this time
        dcoFreqTrim = (csCtl1Read & 0x0070) >> 4;   // Get DCOFTRIM value

        if(newDcoTap < 256) // DCOTAP < 256
        {
            newDcoDelta = 256 - newDcoTap;  // Delta value between DCOTAP and 256
            if((oldDcoTap != 0xffff) && (oldDcoTap >= 256)) // DCOTAP cross 256
            {
                endLoop = true; // Stop while loop
            }
            else
            {
                dcoFreqTrim--;
                HWREG16(CS_BASE +
                        OFS_CSCTL1) =
                    (csCtl1Read & (~0x0070)) | (dcoFreqTrim << 4);
            }
        }
        else   // DCOTAP >= 256
        {
            newDcoDelta = newDcoTap - 256;  // Delta value between DCOTAP and 256
            if(oldDcoTap < 256) // DCOTAP cross 256
            {
                endLoop = true; // Stop while loop
            }
            else
            {
                dcoFreqTrim++;
                HWREG16(CS_BASE +
                        OFS_CSCTL1) =
                    (csCtl1Read & (~0x0070)) | (dcoFreqTrim << 4);
            }
        }

        if(newDcoDelta < bestDcoDelta)  // Record DCOTAP closest to 256
        {
            csCtl0Copy = csCtl0Read;
            csCtl1Copy = csCtl1Read;
            bestDcoDelta = newDcoDelta;
        }
    }
    while(endLoop == false);    // Poll until endLoop == 1

    HWREG16(CS_BASE + OFS_CSCTL0) = csCtl0Copy; // Reload locked DCOTAP
    HWREG16(CS_BASE + OFS_CSCTL1) = csCtl1Copy; // Reload locked DCOFTRIM
    param->csCtl0 = csCtl0Copy;
    param->csCtl1 = csCtl1Copy;
    while(HWREG16(CS_BASE + OFS_CSCTL7) & (FLLUNLOCK0 | FLLUNLOCK1))
    {
        ;                                                               // Poll until FLL is locked
    }
}

void CS_setExternalClockSource(uint32_t XT1CLK_frequency)
{
    privateXT1ClockFrequency = XT1CLK_frequency;
}

void CS_initClockSignal(uint8_t selectedClockSignal,
                        uint16_t clockSource,
                        uint16_t clockSourceDivider)
{
    uint16_t temp;
    switch(selectedClockSignal)
    {
    case CS_ACLK:

        HWREG16(CS_BASE + OFS_CSCTL4) &= ~(SELA);

        if(clockSource == CS_XT1CLK_SELECT)
        {
            clockSource = 0x0;
        }
        clockSource = clockSource << 8;

        HWREG16(CS_BASE + OFS_CSCTL4) |= (clockSource);
#ifdef DIVA0
        if(HWREG16(CS_BASE + OFS_CSCTL6) & XTS)
        {
            temp = HWREG16(CS_BASE + OFS_CSCTL6);
            if(clockSourceDivider != CS_CLOCK_DIVIDER_1)
            {
                clockSourceDivider = (clockSourceDivider - 3) << 8;
                HWREG16(CS_BASE +
                        OFS_CSCTL6) |= temp & ~(DIVA3 | DIVA2 | DIVA1 | DIVA0)
                                       | clockSourceDivider;
            }
        }
#endif
        break;
    case CS_SMCLK:

        HWREG16(CS_BASE + OFS_CSCTL4) &= ~(SELMS_7);
        HWREG16(CS_BASE + OFS_CSCTL4) |= (clockSource);

        temp = HWREG16(CS_BASE + OFS_CSCTL5);
        clockSourceDivider = clockSourceDivider << 4;
        HWREG16(CS_BASE + OFS_CSCTL5) = temp & ~(DIVS_3) | clockSourceDivider;
        break;
    case CS_MCLK:

        HWREG16(CS_BASE + OFS_CSCTL4) &= ~(SELMS_7);
        HWREG16(CS_BASE + OFS_CSCTL4) |= (clockSource);

        temp = HWREG16(CS_BASE + OFS_CSCTL5);
        HWREG16(CS_BASE + OFS_CSCTL5) = temp & ~(DIVM_7) | clockSourceDivider;
        break;
    case CS_FLLREF:

        HWREG8(CS_BASE + OFS_CSCTL3) &= ~(SELREF_3);

        if(clockSource == CS_XT1CLK_SELECT)
        {
            clockSource = 0x0;
        }
        clockSource = clockSource << 4;
        HWREG8(CS_BASE + OFS_CSCTL3) |= (clockSource);

        temp = HWREG8(CS_BASE + OFS_CSCTL3);
        //Note that dividers for FLLREF are slightly different
        //Hence handled differently from other CLK signals
        if(clockSourceDivider != CS_CLOCK_DIVIDER_1)
        {
            if(clockSourceDivider != CS_CLOCK_DIVIDER_512)
            {
                HWREG8(CS_BASE +
                       OFS_CSCTL3) = temp & ~(FLLREFDIV_7) |
                                     (clockSourceDivider - 4);
            }
            else
            {
                HWREG8(CS_BASE +
                       OFS_CSCTL3) |= temp & ~(FLLREFDIV_7) |
                                      (clockSourceDivider - 5);
            }
        }
        break;
    }
}

void CS_turnOnXT1LF(uint16_t xt1Drive){
    //Switch ON XT1 oscillator
    HWREG16(CS_BASE + OFS_CSCTL6) &= ~XT1AUTOOFF;

    //Highest drive setting for turnOnXT1
    HWREG16(CS_BASE + OFS_CSCTL6_L) |= XT1DRIVE1_L | XT1DRIVE0_L;

